import '../class/statusrequest.dart';

handlingData(response) {
  if (response is StatusRequest) {
    return response;
  } else {
    return StatusRequest.success;
  }
}
// الرد بشكل عام : بقوله لو الريسبونس من نوع استيتيس ريقويست فرجعلي الرد ذات نفيه
//والا لو كان الرد ان الاستيتش ريقويست ب نجاح اذا الرد هيكون  ان الاستيتس ريقويت سليمة : ف الحالة دي مبرجعش ريسبونس بل بعلمك ان الداتا صحيحة فكمل

//بقوله هنا لو الريسبونس اللي جايلي من النوع الشمال اطبلعلي الريسبونس نفسه سواء فشل ف السيرفر ولا النت مقفول ولا الفشل بشكل عام
//ولو نجح اطبعلي ان النوع الشمال بقا يمين يحج StatusRequest ب success
